putc:
        ; ---------------------------------
        ; スタックフレームの構築
        ; ---------------------------------
                                            ; +4|出力文字
                                            ; +2|IP(戻り番地)
        push    bp                          ; BP+0|BP(元の値)
        mov     bp, sp                      

        ; ---------------------------------
        ; レジスタの保存
        ; ---------------------------------
        push    ax
        push    bx

        ; ---------------------------------
        ; 処理の開始
        ; ---------------------------------
        mov     al, [bp + 4]                ; 出力文字を取得
        mov     ah, 0x0E                    ; テレタイプ式位置文字出力
        mov     bx, 0x0000                  ; ページ番号と文字色を0に設定
        int     0x10                        ; ビデオBIOSコール

        ; ---------------------------------
        ; レジスタの復帰
        ; ---------------------------------
        pop    bx
        pop    ax

        ; ---------------------------------
        ; スタックフレームの破棄
        ; ---------------------------------
        mov     sp, bp
        pop     bp

        ret
