puts:
        ; ---------------------------------
        ; スタックフレームの構築
        ; ---------------------------------
                                            ; +4|文字列へのアドレス
                                            ; +2|IP(戻り番地)
        push    bp                          ; BP+0|BP(元の値)
        mov     bp, sp                      

        ; ---------------------------------
        ; レジスタの保存
        ; ---------------------------------
        push    ax
        push    bx
        push    si

        ; ---------------------------------
        ; 引数の取得
        ; ---------------------------------
        mov     si, [bp + 4]                ; SI=文字列へのアドレス

        ; ---------------------------------
        ; 処理の開始
        ; ---------------------------------
        mov     ah, 0x0E                    ; テレタイプ式1文字出力
        mov     bx, 0x0000                  ; ページ番号と文字色を0に設定
        cld                                 ; DF = 0; アドレス加算
.10L:
        lobsb                               ; AL = *SI++

        cmp     al, 0                       ; if(AL == 0)
        je      .10E                        ; break

        int     0x10                        ; INT!0(0x0E, AL) // 文字出力
        jmp     .10L                        ; while(1)

.10E:

        ; ---------------------------------
        ; レジスタの復帰
        ; ---------------------------------
        pop    si
        pop    bx
        pop    ax

        ; ---------------------------------
        ; スタックフレームの破棄
        ; ---------------------------------
        mov     sp, bp
        pop     bp

        ret
