reboot:
        ; ---------------------------------
        ; メッセージを表示
        ; ---------------------------------
        cdecl   puts, .s0                   ; 再起動メッセージを表示

        ; ---------------------------------
        ; キーの入力待ち
        ; ---------------------------------
.10L:
        mov     ah, 0x10                    ; BIOSコールだった気がする, int 0x16がキー入力
        int     0x16

        cmp     al, ' '                     ; ZF = AL == ' ';
        jne     .10L                        ; 繰り返し

        ; ---------------------------------
        ; 改行を出力    
        ; ---------------------------------
        cdecl   puts, .s1

        ; ---------------------------------
        ; 再起動
        ; ---------------------------------
        int     0x19                        ; reboot()

        ; ---------------------------------
        ; 出力する文字
        ; ---------------------------------
.s0     db  0x0A, 0x0D, "Push SPACE key to reboot ...", 0
.s1     db  0x0A, 0x0D, 0x0A, 0x0D, 0        ; 改行の出力してるんだろうけど何だこれは
