memcpy:
        ; ---------------------------------
        ; スタックフレームの構築
        ; ---------------------------------



        push    edp
        mov     edp, esp

        ; ---------------------------------
        ; レジスタの保存
        ; ---------------------------------
        push    ecx
        push    esi
        push    edi

        ; ---------------------------------
        ; バイト単位でのコピー
        ; ---------------------------------
        cld
        mov     edi, [edp + 4]
        mov     esi, [edp + 6]
        mov     ecx, [edp + 8]

        rep     movsb      

        ; ---------------------------------
        ; レジスタの復帰
        ; ---------------------------------
        pop     edi
        pop     esi
        pop     ecx

        ; ---------------------------------
        ; スタックフレームの破棄
        ; ---------------------------------
        mov     esp, edp
        pop     edp

        ret
