;************************************************************************
;	画面左下に、回転する棒を表示
;========================================================================
;■書式		: void draw_rotation_bar(void);
;
;■引数		: 無し
;
;■戻り値	: 無し
;************************************************************************
draw_rotation_bar:
		;---------------------------------------
		; 【レジスタの保存】
		;---------------------------------------
		push	eax

		;---------------------------------------
		; タイマー割り込みカウンタを確認
		;---------------------------------------
		mov		eax, [TIMER_COUNT]				; EAX  = タイマー割り込みカウンタ
		shr		eax, 4							; EAX /= 4;    // 16で除算
		cmp		eax, [.index]					; if (EAX != 前回値)
		je		.10E							; {
												;   
		mov		[.index], eax					;   前回値 = EAX;
		and		eax, 0x03						;   EAX &= 0x03; // 0〜3に限定
												;   
		mov		al, [.table + eax]				;   AL = table[index];
		cdecl	draw_char, 0, 29, 0x000F, eax	;   draw_char(); // 文字を表示
												;   
.10E:											; }

		;---------------------------------------
		; 【レジスタの復帰】
		;---------------------------------------
		pop		eax

		ret

ALIGN 4, db 0
.index:		dd 0								; 前回値
.table:		db	"|/-\"							; 表示キャラクタ

