test_and_set:
        ;-----------------------------------------
        ; 【スタックフレームの構築】
        ;-----------------------------------------
        push    ebp
        mov     ebp, esp

        ;-----------------------------------------
        ; 【レジスタの保存】
        ;-----------------------------------------
        push    eax
        push    ebx

        ;-----------------------------------------
        ; テストアンドセット
        ;-----------------------------------------
 		mov		eax, 0							; local  = 0;
		mov		ebx, [ebp + 8]					; global = アドレス;

.10L:											; for ( ; ; )
												; {
		lock bts [ebx], eax						;   CF = TEST_AND_SET(IN_USE, 1);
		jnc		.10E							;   if (0 == CF)
												;     break;
												;   
.12L:											;   for ( ; ; )
												;   {
		bt		[ebx], eax						;     CF = TEST(IN_USE, 1);
		jc		.12L							;     if (0 == CF)
												;       break;
		jmp		.10L							;   }
.10E:											; } 
        ;-----------------------------------------
        ; 【レジスタの復帰】
        ;-----------------------------------------
        pop     ebx
        pop     eax

        ;-----------------------------------------
        ; 【スタックフレームの破棄】
        ;-----------------------------------------
        mov     esp, ebp
        pop     ebp

        ret